tutorials/pnpFoam/oneDFluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs            ("libelectrokineticFoam.so");

application     pnpFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-5;

deltaT          3e-11;

writeControl    runTime;

writeInterval   1e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

adjustTimeStep false;

maxDeltaT      2e-7;

runTimeModifiable true;

functions
{
  #includeFunc singleGraph
}


// ************************************************************************* //
