tutorials/pnpFoam/oneDFluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // fluid density normalized pressure => dimensions change

internalField   uniform 0;

boundaryField
{
    anode
    {
        type            fixedValue;
        value           uniform 0;

    }

    cathode
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    fixedWalls
    {
        type            empty;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
